Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8722.PIC
        <edc:JoinedSFRDef edc:cname="TOS" edc:desc="" edc:name="TOS" edc:nzwidth="0x18" edc:_addr="0xFFD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOS" edc:desc="" edc:mask="0x1fffff" edc:name="TOS" edc:nzwidth="0x15"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TOSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="TOSL" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFFD">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TOSL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TOSL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TOSH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="TOSH" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFFE">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TOSH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TOSH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="TOSU" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="---00000" edc:name="TOSU" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xFFF">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TOSU" edc:desc="" edc:islanghidden="true" edc:mask="0x1f" edc:name="TOSU" edc:nzwidth="0x5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
      </edc:SFRDataSector>
      <edc:NMMRPlace edc:regionid="peripheralnmmrs">
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR0_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR0_Internal" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx" edc:nmmrid="10">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR0_Prescale" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:nmmrid="18">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR1_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR1_Internal" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx" edc:nmmrid="12">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1_Prescale" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:nmmrid="19">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR2_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR2_Prescale" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:nmmrid="20">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR3_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR3_Internal" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx" edc:nmmrid="14">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3_Prescale" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:nmmrid="21">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR4_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR4_Prescale" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:nmmrid="22">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:NMMRPlace>
      <edc:EmulatorZone edc:beginaddr="0xfad" edc:endaddr="0xfba" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="accessram"/>
    </edc:TraditionalModeOnly>
    <edc:ExtendedModeOnly>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="gpre"/>
    </edc:ExtendedModeOnly>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="simple">
    <edc:Pin>
      <edc:VirtualPin edc:name="RH2"/>
      <edc:VirtualPin edc:name="A18"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RH3"/>
      <edc:VirtualPin edc:name="A19"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="AD9"/>
      <edc:VirtualPin edc:name="WR"/>
      <edc:VirtualPin edc:name="P2C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="AD8"/>
      <edc:VirtualPin edc:name="RD"/>
      <edc:VirtualPin edc:name="P2D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="ECCP3"/>
      <edc:VirtualPin edc:name="P3A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="TX2"/>
      <edc:VirtualPin edc:name="CK2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG2"/>
      <edc:VirtualPin edc:name="RX2"/>
      <edc:VirtualPin edc:name="DT2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG3"/>
      <edc:VirtualPin edc:name="CCP4"/>
      <edc:VirtualPin edc:name="P3D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG5"/>
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="Vpp"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG4"/>
      <edc:VirtualPin edc:name="CCP5"/>
      <edc:VirtualPin edc:name="P1D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF7"/>
      <edc:VirtualPin edc:name="SS1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF6"/>
      <edc:VirtualPin edc:name="AN11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVref"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="AN9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="AN8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="C1OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RH7"/>
      <edc:VirtualPin edc:name="AN15"/>
      <edc:VirtualPin edc:name="P1B" edc:ppsval="0x0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RH6"/>
      <edc:VirtualPin edc:name="AN14"/>
      <edc:VirtualPin edc:name="P1C" edc:ppsval="0x0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RH5"/>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="P3B" edc:ppsval="0x0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RH4"/>
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="P3C" edc:ppsval="0x0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="C2OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="AN5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="Vref+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="Vref-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="HLVDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="T1OSI"/>
      <edc:VirtualPin edc:name="ECCP2" edc:ppsval="0x1"/>
      <edc:VirtualPin edc:name="P2A" edc:ppsval="0x1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="T1OSO"/>
      <edc:VirtualPin edc:name="T13CKI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="TX1"/>
      <edc:VirtualPin edc:name="CK1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="RX1"/>
      <edc:VirtualPin edc:name="DT1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ4"/>
      <edc:VirtualPin edc:name="BA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ5"/>
      <edc:VirtualPin edc:name="CE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ6"/>
      <edc:VirtualPin edc:name="LB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ7"/>
      <edc:VirtualPin edc:name="UB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="ECCP1"/>
      <edc:VirtualPin edc:name="P1A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="SCL1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="SDI1"/>
      <edc:VirtualPin edc:name="SDA1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="SDO1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="KBI3"/>
      <edc:VirtualPin edc:name="PGD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="KBI2"/>
      <edc:VirtualPin edc:name="PGC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="KBI1"/>
      <edc:VirtualPin edc:name="PGM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="KBI0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="INT3"/>
      <edc:VirtualPin edc:name="ECCP2" edc:ppsval="0x0"/>
      <edc:VirtualPin edc:name="P2A" edc:ppsval="0x0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="INT2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="INT1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="FLT0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ3"/>
      <edc:VirtualPin edc:name="WRH"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ2"/>
      <edc:VirtualPin edc:name="WRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ1"/>
      <edc:VirtualPin edc:name="OE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ0"/>
      <edc:VirtualPin edc:name="ALE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="AD7"/>
      <edc:VirtualPin edc:name="PSP7"/>
      <edc:VirtualPin edc:name="SS2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="AD6"/>
      <edc:VirtualPin edc:name="PSP6"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="AD5"/>
      <edc:VirtualPin edc:name="PSP5"/>
      <edc:VirtualPin edc:name="SDI2"/>
      <edc:VirtualPin edc:name="SDA2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="AD4"/>
      <edc:VirtualPin edc:name="PSP4"/>
      <edc:VirtualPin edc:name="SDO2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="AD3"/>
      <edc:VirtualPin edc:name="PSP3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="AD2"/>
      <edc:VirtualPin edc:name="PSP2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="AD1"/>
      <edc:VirtualPin edc:name="PSP1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="AD0"/>
      <edc:VirtualPin edc:name="PSP0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="AD15"/>
      <edc:VirtualPin edc:name="ECCP2" edc:ppsval="0x0"/>
      <edc:VirtualPin edc:name="P2A" edc:ppsval="0x0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="AD14"/>
      <edc:VirtualPin edc:name="P1B" edc:ppsval="0x1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="AD13"/>
      <edc:VirtualPin edc:name="P1C" edc:ppsval="0x1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="AD12"/>
      <edc:VirtualPin edc:name="P3B" edc:ppsval="0x1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="AD11"/>
      <edc:VirtualPin edc:name="P3C" edc:ppsval="0x1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="AD10"/>
      <edc:VirtualPin edc:name="CS"/>
      <edc:VirtualPin edc:name="P2B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RH0"/>
      <edc:VirtualPin edc:name="A16"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RH1"/>
      <edc:VirtualPin edc:name="A17"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
